In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df = sns.load_dataset('titanic')

### describe()

In [4]:
df.describe() #아래 사항들을 요약해서 말해줌  #나머지 값들은 숫자가 아니라서 요약을 안 해주는 것

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [5]:
df.describe(include='object') #각각 글자, 숫자에 따라 통계 보여주는 것들이 다름

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

In [8]:
df.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [9]:
df['age'].count() #데이터가 단순히 몇개인지

np.int64(714)

### mean()

In [11]:
arr = np.arange(15).reshape(3, 5)
temp_df = pd.DataFrame(arr)
temp_df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

In [12]:
df.mean(numeric_only = True)

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [13]:
cond = df['adult_male'] == True
df.loc[cond, 'age'].mean()

np.float64(33.17312348668281)

- fare를 30이상 40미만 지불한 승객
- pclass 1등급
- 나이 평균 / count

In [15]:
df = sns.load_dataset('titanic')

In [19]:
c1 = df['fare'] >= 30 
c2 = df['fare'] < 40 #파이썬 처럼 한번에 못 묶음 
c3 = df['pclass'] == 1 

df.loc[c1 & c2 & c3, 'age']

23     28.0
55      NaN
96     71.0
170    61.0
174    56.0
209    40.0
270     NaN
298     NaN
339    45.0
351     NaN
449    52.0
462    47.0
492    55.0
515    47.0
556    48.0
607    27.0
625    61.0
630    80.0
632    32.0
647    56.0
740     NaN
766     NaN
782    29.0
793     NaN
842    30.0
853    16.0
887    19.0
889    26.0
Name: age, dtype: float64

In [20]:
df.loc[c1 & c2 & c3]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
55,1,1,male,NaN,0,0,35.5000,S,First,man,True,C,Southampton,yes,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
170,0,1,male,61.0,0,0,33.5000,S,First,man,True,B,Southampton,no,True
174,0,1,male,56.0,0,0,30.6958,C,First,man,True,A,Cherbourg,no,True
209,1,1,male,40.0,0,0,31.0000,C,First,man,True,A,Cherbourg,yes,True
270,0,1,male,NaN,0,0,31.0000,S,First,man,True,NaN,Southampton,no,True
298,1,1,male,NaN,0,0,30.5000,S,First,man,True,C,Southampton,yes,True
339,0,1,male,45.0,0,0,35.5000,S,First,man,True,NaN,Southampton,no,True
351,0,1,male,NaN,0,0,35.0000,S,First,man,True,C,Southampton,no,True
449,1,1,male,52.0,0,0,30.5000,S,First,man,True,C,Southampton,yes,True
462,0,1,male,47.0,0,0,38.5000,S,First,man,True,E,Southampton,no,True
492,0,1,male,55.0,0,0,30.5000,S,First,man,True,C,Southampton,no,True
515,0,1,male,47.0,0,0,34.0208,S,First,man,True,D,Southampton,no,True
556,1,1,female,48.0,1,0,39.6000,C,First,woman,False,A,Cherbourg,yes,False
607,1,1,male,27.0,0,0,30.5000,S,First,man,True,NaN,Southampton,yes,True
625,0,1,male,61.0,0,0,32.3208,S,First,man,True,D,Southampton,no,True
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
632,1,1,male,32.0,0,0,30.5000,C,First,man,True,B,Cherbourg,yes,True
647,1,1,male,56.0,0,0,35.5000,C,First,man,True,A,Cherbourg,yes,True
740,1,1,male,NaN,0,0,30.0000,S,First,man,True,D,Southampton,yes,True
766,0,1,male,NaN,0,0,39.6000,C,First,man,True,NaN,Cherbourg,no,True
782,0,1,male,29.0,0,0,30.0000,S,First,man,True,D,Southampton,no,True
793,0,1,male,NaN,0,0,30.6958,C,First,man,True,NaN,Cherbourg,no,True
842,1,1,female,30.0,0,0,31.0000,C,First,woman,False,NaN,Cherbourg,yes,True
853,1,1,female,16.0,0,1,39.4000,S,First,woman,False,D,Southampton,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [21]:
df.loc[c1 & c2 & c3, 'age'].count()

np.int64(21)

In [22]:
df.loc[c1 & c2 & c3, 'age'].mean()

np.float64(44.095238095238095)

In [23]:
df.mean(numeric_only = True, skipna = False) #Nan 관련

survived       0.383838
pclass         2.308642
age                 NaN
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

### median

In [24]:
pd.Series([1, 2, 3, 4, 5]).median()

np.float64(3.0)

In [25]:
pd.Series([1, 2, 3, 4, 5]).mean()

np.float64(3.0)

In [26]:
mean_value = df['age'].mean()
median_value = df['age'].median()
print(mean_value, median_value)

29.69911764705882 28.0

In [27]:
### sum

In [28]:
df['fare'].sum()

np.float64(28693.9493)

In [29]:
df['fare'].cumsum() #누적합을 만들어서 새로운 배열

0          7.2500
1         78.5333
2         86.4583
3        139.5583
4        147.6083
          ...
886    28602.7493
887    28632.7493
888    28656.1993
889    28686.1993
890    28693.9493
Name: fare, Length: 891, dtype: float64

In [60]:
df['age'].cumprod()

C:\Users\2-23\Desktop\DMF\pandas\venv\Lib\site-packages\numpy\_core\fromnumeric.py:57: RuntimeWarning: overflow encountered in accumulate
  return bound(*args, **kwds)

0            22.0
1           836.0
2         21736.0
3        760760.0
4      26626600.0
          ...
886           inf
887           inf
888           NaN
889           inf
890           inf
Name: age, Length: 891, dtype: float64

In [33]:
### var(분산)  - 머신러닝에서도 등장하는 개념

In [38]:
# 평균
fare_mean = df['fare'].values.mean()

total = ((df['fare'].values - fare_mean) ** 2).sum() #각각 값에서 평균의 차이 
total_count = df['fare'].count() - 1 
my_var = total + total_count
my_var

np.float64(2198688.7927113734)

### std

In [40]:
np.sqrt(df['fare'].var())

np.float64(49.6934285971809)

In [41]:
df['fare'].std()

np.float64(49.6934285971809)

### agg

In [42]:
df['age'].agg(['mean', 'std'])

mean    29.699118
std     14.526497
Name: age, dtype: float64

In [44]:
df[['age', 'fare'].agg(['mean', 'count'])]

AttributeError: 'list' object has no attribute 'agg'

In [45]:
### quantile (분위)

In [46]:
df['age'].quantile(0.1) #0.1이면 어느지점에 있는지 ?

np.float64(14.0)

In [47]:
df['age'].quantile(0.9)

np.float64(50.0)

### unique

In [50]:
df['who'].unique()

array(['man', 'woman', 'child'], dtype=object)

In [51]:
df['who'].nunique()

3

In [53]:
#가장 출연하는 빈도수가 높은 데이터 
df['who'].mode()

0    man
Name: who, dtype: object

In [55]:
df['deck'].mode() #데크라는 칼럼 값에서 C 값이 제일 많이 나옴

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

### corr
- -1 ~ 1 의 값을 가지고 있음 (반비례 ~ 정비례)

In [58]:
df.corr(numeric_only = True) #상관관계를 보여준다

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [59]:
df.corr(numeric_only = True)['survived']
# survived와의 각각 상관관계

survived      1.000000
pclass       -0.338481
age          -0.077221
sibsp        -0.035322
parch         0.081629
fare          0.257307
adult_male   -0.557080
alone        -0.203367
Name: survived, dtype: float64